Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.InvalidPathCallback Delegate
 The invalid path callback - provides error logging for GetAdvancedOptionPaths when a string is found to be invalid as a path
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void InvalidPathCallback(
	string advancedOption,
	string invalidString,
	string exceptionMessage
)
Public Delegate Sub InvalidPathCallback (
	advancedOption As String,
	invalidString As String,
	exceptionMessage As String
)
Parameters
advancedOption
Type: System.String
The advanced option name.
invalidString
Type: System.String
The invalid string.
exceptionMessage
Type: System.String
The exception message if an exception was thrown when converting the string to a path.
See Also
Reference
Tekla.Structures Namespace